test/load/test.yml
config:
  target: "http://localhost:9999"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Warming up"
    - duration: 15
      arrivalRate: 5
      name: "Ramping up"
    - duration: 180
      arrivalRate: 6
      rampTo: 600
      name: "Sustained load"
  payload:
    path: "./resources/pessoas-payloads.csv"
    fields:
      - "apelido"
      - "nome"
      - "nascimento"
      - "stack"
    order: sequence
    cast: false
  processor: "./processors/convert-stack.js"

scenarios:
  - name: "Register flow"
    flow:
      - post:
          url: "/pessoas"
          beforeRequest: convertStack
          headers:
            Content-Type: "application/json"
          json:
            apelido: "{{ apelido }}"
            nome: "{{ nome }}"
            nascimento: "{{ nascimento }}"
            stack: "{{ stack }}"

  # - name: "Search flow"
  #   flow:
  #     - get:
  #         url: "/pessoas"
  #         qs:
  #           t: "avo"